Revit 2024 API
MEPCurveType.Transition Property
The default transition fitting of the MEP curve type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FamilySymbol Transition { get; set; }
Visual Basic
Public Property Transition As FamilySymbol
	Get
	Set
Visual C++
public:
property FamilySymbol^ Transition {
	FamilySymbol^ get ();
	void set (FamilySymbol^ value);
}
Remarks
This property is used to retrieve the default transition fitting of the MEP curve type, and can be null if there is no default value. Use RoutingPreferenceManager to set this property for PipeType MEPCurves.
See Also
MEPCurveType Class
Autodesk.Revit.DB Namespace